In [1]:
import pandas as pd

In [ ]:
# How to read just specify columns from csv

In [2]:
ufo = pd.read_csv('http://bit.ly/uforeports')

In [3]:
ufo.columns

Index(['City', 'Colors Reported', 'Shape Reported', 'State', 'Time'], dtype='object')

In [4]:
ufo_col = pd.read_csv('http://bit.ly/uforeports', usecols=['City','State'])

In [5]:
ufo_col.columns

Index(['City', 'State'], dtype='object')

In [8]:
#importing just some part of rows

In [9]:
ufo_col_nrows = pd.read_csv('http://bit.ly/uforeports', usecols=['City','State'], nrows=3)

In [10]:
ufo_col_nrows

          City State
0       Ithaca    NY
1  Willingboro    NJ
2      Holyoke    CO

In [12]:
for c in ufo_col_nrows.City:
    print(c)

Ithaca
Willingboro
Holyoke

In [16]:
for index, row in ufo_col_nrows.iterrows():
    print(index, row.City, row.State)

0 Ithaca NY
1 Willingboro NJ
2 Holyoke CO

In [17]:
#what's the best way to drop  every non-numeric column from DF

In [18]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [20]:
drinks.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa

In [21]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [22]:
import numpy as np

In [23]:
drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [25]:
drinks.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object

In [29]:
drinks.describe(include=['object', 'float64'])

        country  total_litres_of_pure_alcohol continent
count       193                    193.000000       193
unique      193                           NaN         6
top     Albania                           NaN    Africa
freq          1                           NaN        53
mean        NaN                      4.717098       NaN
std         NaN                      3.773298       NaN
min         NaN                      0.000000       NaN
25%         NaN                      1.300000       NaN
50%         NaN                      4.200000       NaN
75%         NaN                      7.200000       NaN
max         NaN                     14.400000       NaN